reports/HW5/plans/23127539_Stress_20260815.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
<hashTree>
<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="23127539_Stress_20260815" enabled="true">
  <stringProp name="TestPlan.comments">HW05 Stress: Login -> Search Product -> View Detail -> Add to Cart -> Checkout</stringProp>
  <boolProp name="TestPlan.functional_mode">false</boolProp>
  <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
  <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
    <collectionProp name="Arguments.arguments">
      <elementProp name="host" elementType="Argument"><stringProp name="Argument.name">host</stringProp><stringProp name="Argument.value">localhost</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
      <elementProp name="port" elementType="Argument"><stringProp name="Argument.name">port</stringProp><stringProp name="Argument.value">3000</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
    </collectionProp>
  </elementProp>
</TestPlan>
<hashTree>
  <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV workflow data" enabled="true">
    <stringProp name="filename">../data/workflow-users.csv</stringProp>
    <stringProp name="fileEncoding">UTF-8</stringProp>
    <stringProp name="variableNames">email,password,search,product_id,product_name,price,quantity,shipping_address</stringProp>
    <boolProp name="ignoreFirstLine">true</boolProp>
    <stringProp name="delimiter">,</stringProp>
    <boolProp name="quotedData">true</boolProp>
    <boolProp name="recycle">true</boolProp>
    <boolProp name="stopThread">false</boolProp>
    <stringProp name="shareMode">shareMode.all</stringProp>
  </CSVDataSet><hashTree/>
  <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stress Users" enabled="true">
    <intProp name="ThreadGroup.num_threads">150</intProp>
    <intProp name="ThreadGroup.ramp_time">30</intProp>
    <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>

    <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
      <boolProp name="LoopController.continue_forever">false</boolProp>
      <stringProp name="LoopController.loops">-1</stringProp>
    </elementProp>

    <boolProp name="ThreadGroup.scheduler">true</boolProp>
    <stringProp name="ThreadGroup.duration">150</stringProp>
    <stringProp name="ThreadGroup.delay">0</stringProp>
  </ThreadGroup>
  <hashTree>
    <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think time 300 ms" enabled="true">
      <stringProp name="ConstantTimer.delay">300</stringProp>
    </ConstantTimer><hashTree/>
    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 Login" enabled="true">
    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
       <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="" elementType="HTTPArgument">
            <boolProp name="HTTPArgument.always_encode">false</boolProp>
            <stringProp name="Argument.value">{&quot;email&quot;:&quot;${email}&quot;,&quot;password&quot;:&quot;${password}&quot;}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
       </elementProp>
    <stringProp name="HTTPSampler.domain">${host}</stringProp>
    <stringProp name="HTTPSampler.port">${port}</stringProp>
    <stringProp name="HTTPSampler.protocol">http</stringProp>
    <stringProp name="HTTPSampler.path">/api/login</stringProp>
    <stringProp name="HTTPSampler.method">POST</stringProp>
    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  </HTTPSamplerProxy>
  <hashTree>
    <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="01 Login Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager><hashTree/>
    <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract token" enabled="true">
      <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
      <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
      <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
    </JSONPostProcessor><hashTree/>
    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="01 Login HTTP 200" enabled="true">
      <collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp>
      <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
      <boolProp name="Assertion.assume_success">false</boolProp>
      <intProp name="Assertion.test_type">8</intProp>
    </ResponseAssertion><hashTree/>
  </hashTree>
    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 Search Product" enabled="true">
    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp>
    <stringProp name="HTTPSampler.domain">${host}</stringProp>
    <stringProp name="HTTPSampler.port">${port}</stringProp>
    <stringProp name="HTTPSampler.protocol">http</stringProp>
    <stringProp name="HTTPSampler.path">/api/products?search=${search}</stringProp>
    <stringProp name="HTTPSampler.method">GET</stringProp>
    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  </HTTPSamplerProxy>
  <hashTree>
    
    
    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="02 Search Product HTTP 200" enabled="true">
      <collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp>
      <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
      <boolProp name="Assertion.assume_success">false</boolProp>
      <intProp name="Assertion.test_type">8</intProp>
    </ResponseAssertion><hashTree/>
  </hashTree>
    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="03 View Detail" enabled="true">
    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp>
    <stringProp name="HTTPSampler.domain">${host}</stringProp>
    <stringProp name="HTTPSampler.port">${port}</stringProp>
    <stringProp name="HTTPSampler.protocol">http</stringProp>
    <stringProp name="HTTPSampler.path">/api/products/${product_id}</stringProp>
    <stringProp name="HTTPSampler.method">GET</stringProp>
    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  </HTTPSamplerProxy>
  <hashTree>
    
    
    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="03 View Detail HTTP 200" enabled="true">
      <collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp>
      <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
      <boolProp name="Assertion.assume_success">false</boolProp>
      <intProp name="Assertion.test_type">8</intProp>
    </ResponseAssertion><hashTree/>
  </hashTree>
    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="04 Add to Cart" enabled="true">
    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
       <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="" elementType="HTTPArgument">
            <boolProp name="HTTPArgument.always_encode">false</boolProp>
            <stringProp name="Argument.value">{&quot;id&quot;:${product_id},&quot;name&quot;:&quot;${product_name}&quot;,&quot;price&quot;:${price},&quot;quantity&quot;:${quantity}}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
       </elementProp>
    <stringProp name="HTTPSampler.domain">${host}</stringProp>
    <stringProp name="HTTPSampler.port">${port}</stringProp>
    <stringProp name="HTTPSampler.protocol">http</stringProp>
    <stringProp name="HTTPSampler.path">/api/cart</stringProp>
    <stringProp name="HTTPSampler.method">POST</stringProp>
    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  </HTTPSamplerProxy>
  <hashTree>
    <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="04 Add to Cart Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${token}</stringProp>
            </elementProp>
<elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager><hashTree/>
    
    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="04 Add to Cart HTTP 200" enabled="true">
      <collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp>
      <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
      <boolProp name="Assertion.assume_success">false</boolProp>
      <intProp name="Assertion.test_type">8</intProp>
    </ResponseAssertion><hashTree/>
  </hashTree>
    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="05 Checkout" enabled="true">
    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
       <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="" elementType="HTTPArgument">
            <boolProp name="HTTPArgument.always_encode">false</boolProp>
            <stringProp name="Argument.value">{&quot;total_amount&quot;:${__groovy(Integer.parseInt(vars.get('price')) * Integer.parseInt(vars.get('quantity')))},&quot;shipping_address&quot;:&quot;${shipping_address}&quot;}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
       </elementProp>
    <stringProp name="HTTPSampler.domain">${host}</stringProp>
    <stringProp name="HTTPSampler.port">${port}</stringProp>
    <stringProp name="HTTPSampler.protocol">http</stringProp>
    <stringProp name="HTTPSampler.path">/api/checkout</stringProp>
    <stringProp name="HTTPSampler.method">POST</stringProp>
    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  </HTTPSamplerProxy>
  <hashTree>
    <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="05 Checkout Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${token}</stringProp>
            </elementProp>
<elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager><hashTree/>
    
    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="05 Checkout HTTP 200" enabled="true">
      <collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp>
      <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
      <boolProp name="Assertion.assume_success">false</boolProp>
      <intProp name="Assertion.test_type">8</intProp>
    </ResponseAssertion><hashTree/>
  </hashTree>
  </hashTree>
  <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
    <boolProp name="ResultCollector.error_logging">false</boolProp>
  </ResultCollector><hashTree/>
</hashTree>
</hashTree>
</jmeterTestPlan>